#include <iostream>
#include <iomanip>

using namespace std;

/*
ไลบรารี <iomanip> เป็นไลบรารีในภาษา C++ ที่มีไว้สำหรับจัดรูปแบบการแสดงผลทางตัวเลข โดยเฉพาะค่าทศนิยม 
ซึ่งมีฟังก์ชันและโครงสร้างข้อมูลหลายอย่างที่เกี่ยวข้องกับการจัดรูปแบบการแสดงผลดังนี้:

std::setprecision(n): กำหนดจำนวนตำแหน่งทศนิยมที่จะแสดงในผลลัพธ์ทางตัวเลข.
std::fixed: กำหนดให้แสดงจุดทศนิยมในรูปแบบที่ถูกกำหนดไว้ (ไม่ใช้รูปแบบสกีนติฟิก).
std::scientific: แสดงผลลัพธ์ในรูปแบบสกีนติฟิก (รูปแบบทางวิทยาศาสตร์).
std::setw(n): กำหนดความกว้างของช่องสำหรับแสดงผลลัพธ์ (ในจำนวนตัวอักษร).
std::left และ std::right: กำหนดจัดแสดงผลลัพธ์ทางตัวเลขด้านซ้ายหรือด้านขวา.
std::showpoint: แสดงจุดทศนิยมแม้จะไม่มีค่าทศนิยม.
std::setfill(c): กำหนดตัวอักษรที่จะใช้เติมช่องว่างหรือช่องว่างหน้าค่าทางตัวเลข.

การใช้งาน iomanip ช่วยให้คุณสามารถควบคุมรูปแบบการแสดงผลของข้อมูลทางตัวเลขในโปรแกรม C++ ได้อย่างหลากหลายและแม่นยำ.
*/

int main() {
    double num = 3.14159;

    cout << fixed << setprecision(2) << num << endl;

    cout << fixed << setprecision(4) << num << endl;

    return 0;
}